# Aula 7

# Pandas

In [1]:
import pandas as pd

In [2]:
# pandas permite manipular dados
# operações numericas
# visualização de dados

* series é equivalente a uma coluna
* dataframe é equivalente a uma tabela

In [6]:
# criar 
data = {
    'apples': [3, 2, 0,1],
    'oranges': [0, 3, 7, 2]
}

purchases = pd.DataFrame(data)
purchases

   apples  oranges
0       3        0
1       2        3
2       0        7
3       1        2

In [7]:
purchases = pd.DataFrame(data, index =[ 'june', 'robert', 'lily', 'david'])
purchases

        apples  oranges
june         3        0
robert       2        3
lily         0        7
david        1        2

In [9]:
purchases.loc['june']

apples     3
oranges    0
Name: june, dtype: int64